import requests

items_text = """南京林业大学\t经济管理学院
南京林业大学\t信息科学技术学院
南京林业大学\t风景园林学院
南京林业大学\t理学院
南京林业大学\t信息科学技术学院（人工智能学院）
南京林业大学\t研究生院
南京林业大学\t继续教育学院
南京林业大学\t国际教育学院
江苏大学\t材料科学与工程学院
江苏大学\t艺术学院
江苏大学\t国际基因组学研究中心挂靠
江苏大学\t海外教育学院，“一带一路”国际人才学院、国际组织人才学院挂靠
江苏大学\t智能农机装备理论与技术重点实验室、农业工程学部（合署）
江苏大学\t克兰菲尔德未来技术研究生院、韦恩国际学院（筹）(合署）
江苏大学\t梦溪学院
江苏大学\t卓越医师学院、江滨临床医学院（合署）
江苏大学\t菁英学院
江苏大学\t国际学院"""

res = requests.post("http://127.0.0.1:8000/api/collect_batch", json={"items_text": items_text})
print("Batch submitted:", res.json())

